{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_130", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_131"}}, {"class_name": "Dense", "config": {"name": "dense_546", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_547", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_548", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_549", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_550", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_551", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_552", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_553", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_554", "trainable": true, "dtype": "float32", "units": 314, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_555", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "mse", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.00019999999494757503, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_546/kernel", "shape": [15, 314], "dtype": "float32"}, {"name": "dense_546/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_547/kernel", "shape": [314, 314], "dtype": "float32"}, {"name": "dense_547/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_548/kernel", "shape": [314, 314], "dtype": "float32"}, {"name": "dense_548/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_549/kernel", "shape": [314, 314], "dtype": "float32"}, {"name": "dense_549/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_550/kernel", "shape": [314, 314], "dtype": "float32"}, {"name": "dense_550/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_551/kernel", "shape": [314, 314], "dtype": "float32"}, {"name": "dense_551/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_552/kernel", "shape": [314, 314], "dtype": "float32"}, {"name": "dense_552/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_553/kernel", "shape": [314, 314], "dtype": "float32"}, {"name": "dense_553/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_554/kernel", "shape": [314, 314], "dtype": "float32"}, {"name": "dense_554/bias", "shape": [314], "dtype": "float32"}, {"name": "dense_555/kernel", "shape": [314, 1], "dtype": "float32"}, {"name": "dense_555/bias", "shape": [1], "dtype": "float32"}]}]}